# Merging Data

1. Import Libraries and Dataframes
2. Merge df_ords and df_ords_prior
3. Merge df_merged_large and df_productsÂ¶
4. Export Merged Dataframe

## 1. Import Libraries/Dataframes

In [44]:
# import libraries 
import pandas as pd
import numpy as np
import os

In [45]:
# data folder path
path_git = r'/Users/catherinemikelson/Desktop/Career Foundry/Acheivement 4 - Python Fundmentals/Instacart Basket Analysis Github'

In [46]:
# data folder path
path = r'/Users/catherinemikelson/Desktop/Career Foundry/Acheivement 4 - Python Fundmentals/Instacart Basket Analysis'

In [47]:
# Import order_products
df_ords_prior = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'order_products_prior.csv'), index_col = False)

In [48]:
# check output
df_ords_prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [49]:
# check shape
df_ords_prior.shape

(32434489, 4)

In [50]:
# import orders_cleaned
df_ords = pd.read_csv(os.path.join(path_git, '02 Data', 'orders_cleaned_git.csv'), index_col = False)

In [51]:
# check output
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,new_customer
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False

In [52]:
# drop duplicate index
df_ords = df_ords.drop('Unnamed: 0', axis = 1)

In [53]:
# check output
df_ords.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,new_customer
0,2539329,1,1,2,8,NaN,True
1,2398795,1,2,3,7,15.0,False
2,473747,1,3,3,12,21.0,False
3,2254736,1,4,4,7,29.0,False
4,431534,1,5,4,15,28.0,False

In [54]:
# check shape
df_ords.shape

(3421083, 7)

In [55]:
# import products_cleaned
df_products = pd.read_csv(os.path.join(path_git, '02 Data', 'prods_cleaned_git.csv'))

In [56]:
# check output
df_products.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [57]:
# drop index duplicate
df_products = df_products.drop('Unnamed: 0', axis = 1)

In [58]:
df_products.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [59]:
# check shape
df_products.shape

(49672, 5)

## 2. Merge df_ords and df_ords_prior

Note: df_ords will be merged with df_ords_prior, a new dataframe, in order to add product_id to the dataframe.

In [61]:
# merge df_ords and df_ords_prior
df_merged_large = df_ords.merge(df_ords_prior, on = 'order_id', indicator = True)

In [62]:
# check output
df_merged_large.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,both

In [63]:
# check shape
df_merged_large.shape

(32434489, 11)

In [64]:
# check value counts for '_merge' column
df_merged_large['_merge'].value_counts()

both          32434489
left_only            0
right_only           0
Name: _merge, dtype: int64

Observation: Success! The new data frame has the same number rows and columns as expected from the merge.

## 3. Merge df_merged_large and df_products

Note: Merging in df_prods will give more specific details on products that were purchased.

In [65]:
# merge df_merged_large and df_products
df_merged_large_prods = df_merged_large.merge(df_products, on = 'product_id')

In [66]:
# check output
df_merged_large_prods.head()

,order_id,user_id,order_number,orders_day_of_the_week,order_hour_of_day,days_since_prior_order,new_customer,product_id,add_to_cart_order,reordered,_merge,product_name,aisle_id,department_id,prices
0,2539329,1,1,2,8,NaN,True,196,1,0,both,Soda,77,7,9.0
1,2398795,1,2,3,7,15.0,False,196,1,1,both,Soda,77,7,9.0
2,473747,1,3,3,12,21.0,False,196,1,1,both,Soda,77,7,9.0
3,2254736,1,4,4,7,29.0,False,196,1,1,both,Soda,77,7,9.0
4,431534,1,5,4,15,28.0,False,196,1,1,both,Soda,77,7,9.0

In [67]:
# check merge
df_merged_large_prods['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

Observation: Success! The number of rows is consistent with rows pre-merge.

## 4. Export Merged Dataframe

In [68]:
# export dataframe
df_merged_large_prods.to_pickle(os.path.join(path_git, '02 Data', 'ords_prods_merged.pkl'))